//initServer
medalList=[ // [序号,勋章名称,介绍] 序号可不按顺序,但必须唯一.序号是识别勋章的唯一途径.
	[1,"CCO勋章","颁发给所有CCO战队成员"],
	[2,"APP勋章","颁发给所有对CCO有过卓越贡献的玩家"],
	[3,"三级组织勋章","颁发给组织过动态任务的导演"],
	[4,"二级组织勋章","颁发给组织过静态任务的导演"],
	[5,"一级组织勋章","颁发给独立组织过静态任务的导演"],
	[6,"天马行空勋章","颁发剧本被采纳的玩家"],
	[20,"联盟英雄","颁发给所有立下英雄事业的玩家"],
	[21,"红旗勋章","直接参加战斗而表现特别勇敢和英勇的"],
	[22,"一级光荣勋章","保卫祖国的战斗中立有战功和表现英勇顽强、无所畏惧的士兵、军士以及空军少尉，且获得过二级光荣勋章"],
	[23,"二级光荣勋章","保卫祖国的战斗中立有战功和表现英勇顽强、无所畏惧的士兵、军士以及空军少尉，且获得过三级光荣勋章"],
	[24,"三级光荣勋章","保卫祖国的战斗中立有战功和表现英勇顽强、无所畏惧的士兵、军士以及空军少尉"],
	[25,"近卫军勋章","所在部队被授予近卫军称号"],
	[40,"优秀指战员勋章","颁发给所有杰出的队长"],
	[41,"优秀陆军士兵勋章","颁发给个人能力突出的陆军士兵"],
	[42,"优秀空军士兵勋章","颁发给个人能力突出的固定翼飞行员"],
	[43,"优秀陆军航空兵勋章","颁发给个人能力突出的直升机飞行员"],
	[44,"优秀新兵","颁发给个人能力突出的新兵"],
	[50,"杰出医疗兵","颁发给表现杰出的医疗兵"],
	[51,"杰出反坦克射手","颁发给表现杰出的反坦克射手"],
	[52,"杰出防空射手","颁发给表现杰出的防空射手"],
	[53,"杰出精确射手","颁发给表现杰出的精确射手"],
	[54,"杰出狙击手","颁发给表现杰出的狙击手"],
	[55,"杰出工程兵","颁发给表现杰出的工程兵"],
	[56,"杰出坦克兵","颁发给杰出表现的坦克兵"],
	[57,"杰出固定武器操作员","颁发给杰出表现的重机枪手、榴弹操作员"],
	[58,"杰出炮兵","颁发给杰出表现的炮兵"],
	[59,"杰出无人机操作员","颁发给杰出表现的无人机操作员"],
	[60,"杰出掷弹兵","颁发给杰出表现的掷弹兵"],
	[61,"杰出侦察兵","颁发给杰出表现的侦察兵"],
	[62,"杰出潜水员","颁发给杰出表现的潜水员"],
	[63,"杰出直升机飞行员","颁发给杰出表现的直升机飞行员"],
	[64,"杰出固定翼飞行员","颁发给杰出表现的固定翼飞行员"],
	[64,"杰出队长","颁发给杰出表现的队长"],
	[64,"杰出直升机炮手","颁发给杰出表现的直升机炮手"],
	[65,"杰出新兵","颁发给杰出表现的新兵"],
	[80,"ВДВ","曾经作为VDV参加过战斗"],
	[81,"Спецназ","曾经作为特种部队参加过战斗"],
	[82,"ВМФ","曾经作为红海军参加过战斗"],
	[83,"МСВ","曾经作为摩托化步兵部队参加过战斗"],
	[84,"ТВ","曾经作为坦克部队参加过战斗"],
	[100,"测试勋章","颁发给所有参与导演服测试的玩家"],
	[101,"自由LePort勋章","颁发给所有参加解放LePort近邻岛屿的玩家"],
	[102,"秃鹫勋章","颁发给所有参加秃鹫行动的玩家"]
];

correctMedalIndex = 102;//只有一个序号而且必须在勋章列表里!!!
correctMedal = medalList select {_x#0 == correctMedalIndex};
correctMedal = correctMedal#0;
publicVariable "correctMedal";
publicVariable "medalList";

listOfMetalOwned = profileNamespace getVariable ["listOfMetalOwned",createHashMap];
publicVariable "listOfMetalOwned";